project/test_automation/bw-exp/Expedia-BW-Booking/TC01.010/HttpRQ1-EXPmodifyReservation.xml

<?xml version="1.0" encoding="utf-8"?>

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
	<soap-env:Header>
		<Interface xmlns="http://www.newtrade.com/expedia/R14/header" Name="ExpediaDirectConnect" Version="4.0">
			<PayloadInfo ExpirationDateTime="2018-03-22T19:43:00-07:00" Location="Body" RequestId="REQ01010MOD1" RequestorId="Expedia.com" ResponderId="BW_DerbySoft">
				<CommDescriptor DestinationId="BW_DerbySoft" RetryIndicator="false" SourceId="ExpediaDC">
					<Authentication Password="x2zlfSYB" Username="Expedia"/>
				</CommDescriptor>
				<PayloadDescriptor Name="OTA_HotelResModifyNotifRQ" Version="2003A">
					<PayloadReference DistributorHotelId="25268" SupplierBrandCode="BW" SupplierChainCode="BW" SupplierHotelCode="19010"/>
				</PayloadDescriptor>
			</PayloadInfo>
		</Interface>
	</soap-env:Header>
	<soap-env:Body>
		<OTA_HotelResModifyNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" EchoToken="REQ01010MOD1" PrimaryLangID="en-us" ResStatus="Commit" Target="Production" TimeStamp="2018-03-22T17:13:00-07:00" Version="1.000">
			<POS>
				<Source>
					<RequestorID ID="A-Expedia" Type="18"/>
					<BookingChannel Primary="true" Type="2">
						<CompanyName>Expedia</CompanyName>
					</BookingChannel>
				</Source>
				<Source>
					<RequestorID ID="50649454" Type="5"/>
				</Source>
			</POS>
			<HotelResModifies>
				<HotelResModify CreateDateTime="2018-03-22T17:14:00-07:00" CreatorID="Expedia" RoomStayReservation="true">
					<UniqueID ID="CHN01010" Type="14"/>
					<RoomStays>
						<RoomStay>
							<RoomTypes>
								<RoomType IsRoom="true" RoomTypeCode="2220470"/>
							</RoomTypes>
							<RatePlans>
								<RatePlan EffectiveDate="2018-05-17" ExpireDate="2018-05-18" RatePlanCode="EX1">
									<Commission Percent="0.1500"/>
								</RatePlan>
							</RatePlans>
							<RoomRates>
								<RoomRate EffectiveDate="2018-05-17" ExpireDate="2018-05-18" NumberOfUnits="1" RatePlanCode="EX1" RoomTypeCode="2220470">
									<Rates>
										<Rate EffectiveDate="2018-05-17" ExpireDate="2018-05-18" RateTimeUnit="Day" UnitMultiplier="1">
											<Base AmountBeforeTax="100.00" CurrencyCode="USD"/>
											<Fees>
												<Fee Amount="0.00" Code="1" CurrencyCode="USD" TaxInclusive="false" Type="Exclusive"/>
											</Fees>
										</Rate>
									</Rates>
								</RoomRate>
							</RoomRates>
							<GuestCounts IsPerRoom="true">
								<GuestCount AgeQualifyingCode="10" Count="2" />
							</GuestCounts>
							<TimeSpan End="2018-05-18" Start="2018-05-17"/>
							<Guarantee>
								<GuaranteesAccepted>
									<GuaranteeAccepted>
										<PaymentCard CardCode="VI" CardNumber="5111111111111118" CardType="1" ExpireDate="1220">
											<CardHolderName>Mrs. Shelia Brown</CardHolderName>
											<Address FormattedInd="false">
												<AddressLine>Booked offline</AddressLine>
												<CityName>Booked offline</CityName>
												<PostalCode>55555</PostalCode>
												<StateProv StateCode="N/A"/>
												<CountryName Code="US"/>
											</Address>
										</PaymentCard>
									</GuaranteeAccepted>
								</GuaranteesAccepted>
							</Guarantee>
							<Total AmountAfterTax="113.75" CurrencyCode="USD">
								<Taxes Amount="13.75" CurrencyCode="USD">
									<Tax Amount="13.75" Code="27" CurrencyCode="USD" Type="Exclusive"/>
								</Taxes>
							</Total>
							<BasicPropertyInfo BrandCode="BW" ChainCode="BW" HotelCode="19010"/>
							<ResGuestRPHs>
								<ResGuestRPH RPH="1"/>
							</ResGuestRPHs>
							<SpecialRequests>
								<SpecialRequest Language="en-us" RequestCode="1.14">
									<Text Formatted="false" Language="en-us">2 King Normal Bed</Text>
								</SpecialRequest>
								<SpecialRequest Language="en-us" RequestCode="2.1">
									<Text Formatted="false" Language="en-us">Quiet Area</Text>
								</SpecialRequest>
								<SpecialRequest Language="en-us" RequestCode="5">
									<Text Formatted="true" Language="en-us">Payment When Arrival</Text>
								</SpecialRequest>
							</SpecialRequests>
						</RoomStay>
					</RoomStays>
					<ResGuests>
						<ResGuest AgeQualifyingCode="10" ResGuestRPH="1">
							<Profiles>
								<ProfileInfo>
									<Profile ProfileType="1">
										<Customer>
											<PersonName>
												<GivenName>Geoge</GivenName>
												<Surname>Meals</Surname>
											</PersonName>
											<Telephone AreaCityCode="123" CountryAccessCode="2" PhoneNumber="88888888"/>
										</Customer>
									</Profile>
								</ProfileInfo>
							</Profiles>
						</ResGuest>
					</ResGuests>
					<ResGlobalInfo>
						<HotelResModifyIDs>
							<HotelResModifyID ResID_Date="2018-03-22T17:14:00-07:00" ResID_Source="Expedia" ResID_Type="8" ResID_Value="CHN01010"/>
							<HotelResModifyID ResID_Date="2018-04-27T07:03:50.348Z" ResID_Source="BW_DerbySoft" ResID_Type="3" ResID_Value="HTL01010"/>
						</HotelResModifyIDs>
					</ResGlobalInfo>
				</HotelResModify>
			</HotelResModifies>
		</OTA_HotelResModifyNotifRQ>
	</soap-env:Body>
</soap-env:Envelope>